[source::azure_event_hub://Defender_Security_Center]
KV_MODE = json
TIME_FORMAT = %Y-%m-%dT%H:%M:%S.%7QZ
TIME_PREFIX = \{"time": "
category = Splunk App Add-on Builder
TRUNCATE = 0
pulldown_type = 1

# Common fields for all datasets
EVAL-dest = case('properties.DeviceName' != "null", 'properties.DeviceName', 1==1, null())
EVAL-action = case(category=="AdvancedHunting-DeviceProcessEvents","allowed", category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileCreated", "created", category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileModified", "modified", category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileDeleted", "deleted", category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileRenamed", "renamed", category=="AdvancedHunting-DeviceRegistryEvents" AND 'properties.ActionType' IN ("RegistryValueDeleted","RegistryKeyDeleted"), "deleted", category=="AdvancedHunting-DeviceRegistryEvents" AND 'properties.ActionType' IN ("RegistryValueSet","RegistryKeyCreated"), "created", category=="AdvancedHunting-EmailEvents",case('properties.DeliveryAction'=="Delivered","delivered",'properties.DeliveryAction'=="Blocked","blocked",'properties.DeliveryAction'=="Junked","deleted",'properties.DeliveryAction'=="Replaced","quarantined",true(),"other"), 1==1, "unknown")
EVAL-app = case(category IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), coalesce('properties.ServiceSource', "Microsoft Defender for Endpoint"), 1==1, null())
EVAL-file_hash = case('properties.MD5' != "null", 'properties.MD5', 'properties.SHA1' != "null", 'properties.SHA1', 'properties.SHA256' != "null", 'properties.SHA256')
EVAL-file_name = case(category IN ("AdvancedHunting-DeviceFileEvents", "AdvancedHunting-EmailAttachmentInfo", "AdvancedHunting-AlertEvidence") AND 'properties.FileName' != "null", 'properties.FileName')
EVAL-signature = case(category IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), 'properties.Title', category=="AdvancedHunting-EmailEvents",if('properties.EmailAction'=="null","No action taken",'properties.EmailAction'), 1==1, null())
EVAL-user = case(category IN ("AdvancedHunting-DeviceProcessEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence") AND 'properties.AccountName' != "null", 'properties.AccountName', category=="AdvancedHunting-DeviceImageLoadEvents", 'properties.InitiatingProcessAccountName', category=="AdvancedHunting-DeviceNetworkEvents", 'properties.InitiatingProcessAccountName', category=="AdvancedHunting-DeviceFileEvents", 'properties.InitiatingProcessAccountName', category=="AdvancedHunting-DeviceRegistryEvents", 'properties.InitiatingProcessAccountName', category=="AdvancedHunting-DeviceAlertEvents",'properties.AccountName')
EVAL-vendor_product = "Microsoft Defender for Endpoint"
EVAL-src = case(category=="AdvancedHunting-DeviceNetworkEvents", 'properties.Timestamp', category=="AdvancedHunting-EmailEvents", 'properties.SenderIPv4')

# Alerts node
# Does not work. Bug SPL-205994 to be fixed in 8.3.0
# Error in 'eval' command: The arguments to the 'mvmap' function are invalid.
#EVAL-mitre_technique_id = mvmap(json_array_to_mv('properties.MitreTechniques'), replace('properties.MitreTechniques', "(.+)\((\S+)\)$", "\2"))
# mitre_technique_name is not a CIM field, but useful perhaps
EVAL-mitre_technique_name = json_array_to_mv('properties.AttackTechniques')
EVAL-id = case(category IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), 'properties.AlertId', 1==1, null())
EVAL-severity = case(category IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), lower('properties.Severity'), 1==1, null())
EVAL-type = case(category IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), "alert", 1==1, null())
EVAL-description = case(category IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertEvidence"), 'properties.AdditionalFields', 1==1, null())
EVAL-vendor_account = case(category IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), 'properties.tenantId', 1==1, null())

# Email node
EVAL-filter_action = case(category=="AdvancedHunting-EmailEvents",'properties.EmailActionPolicy')
EVAL-internal_message_id = case(category IN ("AdvancedHunting-EmailEvents","AdvancedHunting-EmailAttachmentInfo"),'properties.NetworkMessageId')
EVAL-message_id = case(category=="AdvancedHunting-EmailEvents",'properties.InternetMessageId')
EVAL-message_info = case(category=="AdvancedHunting-EmailEvents",'properties.ConfidenceLevel')
EVAL-recipient = case(category IN ("AdvancedHunting-EmailEvents","AdvancedHunting-EmailAttachmentInfo"),'properties.RecipientEmailAddress')
EVAL-recipient_count =  case(category IN ("AdvancedHunting-EmailEvents","AdvancedHunting-EmailAttachmentInfo"),mvcount('properties.RecipientEmailAddress'))
EVAL-recipient_domain = case(category IN ("AdvancedHunting-EmailEvents","AdvancedHunting-EmailAttachmentInfo"),replace('properties.RecipientEmailAddress',"[^@]+@(.*)","\1"))
EVAL-signature_extra = case(category=="AdvancedHunting-EmailEvents",'properties.DetectionMethods')
EVAL-signature_id = case(category=="AdvancedHunting-EmailEvents",'properties.EmailActionPolicyGuid')
EVAL-src_user = case(category IN ("AdvancedHunting-EmailEvents","AdvancedHunting-EmailAttachmentInfo"),'properties.SenderFromAddress')
EVAL-src_user_domain = case(category IN ("AdvancedHunting-EmailEvents","AdvancedHunting-EmailAttachmentInfo"),replace('properties.SenderFromAddress',"[^@]+@(.*)","\1"))
EVAL-subject = case(category=="AdvancedHunting-EmailEvents",'properties.Subject')

# DNS node
# Not applicable

# Ports node
EVAL-dest_ip = case('properties.LocalIP' != "null", 'properties.LocalIP', 1==1, null())
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_ports_dest_port = properties.LocalPort as dest_port
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_ports_src_port = properties.RemotePort as src_port
EVAL-creation_time = case(category=="AdvancedHunting-DeviceNetworkEvents",'properties.Timestamp')
EVAL-state = case(category=="AdvancedHunting-DeviceNetworkEvents","listening")
EVAL-transport = lower('properties.Protocol')

# Filesystem node
EVAL-file_access_time = case(category=="AdvancedHunting-DeviceFileEvents",'properties.Timestamp')
EVAL-file_acl = case(category=="AdvancedHunting-DeviceFileEvents",'properties.InitiatingProcessTokenElevation')
EVAL-file_create_time = case(category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileCreated",'properties.Timestamp')
EVAL-file_modify_time = case(category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileModified",'properties.Timestamp')
EVAL-file_path = case(category=="AdvancedHunting-DeviceFileEvents",'properties.FolderPath')
EVAL-file_size = case(category=="AdvancedHunting-DeviceFileEvents" AND 'properties.FileSize' != "null",'properties.FileSize')

# Registry node
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_registry = properties.RegistryValueType as registry_value_type
EVAL-registry_hive = case(category=="AdvancedHunting-DeviceRegistryEvents", if(isnull('properties.RegistryKey') OR 'properties.RegistryKey'="", replace('properties.PreviousRegistryKey',"(HKEY[_\w]+(\\\\(SAM|SECURITY|SOFTWARE|SYSTEM|\.DEFAULT))?).*","\1"), replace('properties.RegistryKey',"(HKEY[_\w]+(\\\\(SAM|SECURITY|SOFTWARE|SYSTEM|\.DEFAULT))?).*","\1")))
EVAL-registry_key_name = case(category=="AdvancedHunting-DeviceRegistryEvents", replace('properties.RegistryKey',".+\\\\",""))
EVAL-registry_path = case(category=="AdvancedHunting-DeviceRegistryEvents", if(isnull('properties.RegistryKey') OR 'properties.RegistryKey'="", 'properties.PreviousRegistryKey', 'properties.RegistryKey'))
EVAL-registry_value_name = case(category=="AdvancedHunting-DeviceRegistryEvents", 'properties.RegistryValueName')
EVAL-registry_value_type = case(category=="AdvancedHunting-DeviceRegistryEvents", 'properties.RegistryValueType')

# Processes node
REPORT-0defender-process-parent_process_name_args = defender-process-parent_process_name_args
REPORT-0defender-process-parent_process_path_no_filename = defender-process-parent_process_path_no_filename
REPORT-0defender-process-process_name_args = defender-process-process_name_args
REPORT-0defender-process-process_path_no_filename = defender-process-process_path_no_filename

EVAL-cmdline = case('properties.ProcessCommandLine' != "null", 'properties.ProcessCommandLine', 1==1, null())
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_parent_process_id = properties.InitiatingProcessId AS parent_process_id
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_parent_process_name = properties.InitiatingProcessFileName AS parent_process_name
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_parent_process_path = properties.InitiatingProcessFolderPath AS parent_process_path
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_process_id = properties.ProcessId as process_id
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_process_integrity_level = properties.ProcessIntegrityLevel AS process_integrity_level
EVAL-process_name = case('properties.FileName' != "null", 'properties.FileName', 1==1, null())
EVAL-process_path = case('properties.FolderPath' != "null", 'properties.FolderPath', 1==1, null())
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_user_id = properties.AccountUpn AS user_id

EVAL-process_hash = "MD5=" . 'properties.MD5' . ",SHA1=" . 'properties.SHA1' . ",SHA256=" . 'properties.SHA256'
EVAL-parent_process_hash = "MD5=" . 'properties.InitiatingProcessMD5' . ",SHA1=" . 'properties.InitiatingProcessSHA1' . ",SHA256=" . 'properties.InitiatingProcessSHA256'
# Not 100% sure about these two
EVAL-process_guid = case('properties.AccountObjectId' == "null", null(), isnotnull('properties.AccountObjectId'), "{" . upper('properties.AccountObjectId') . "}")
EVAL-parent_process_guid = case('properties.InitiatingProcessAccountObjectId' == "null", null(), isnotnull('properties.InitiatingProcessAccountObjectId'), "{" . upper('properties.InitiatingProcessAccountObjectId') . "}")
# I am making a lot of assumptions here
EVAL-process = case(category IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), if(process_name != "null", process_name, null()), 1==1, coalesce(process_path_no_filename, "") .  "\\" . coalesce(trim(process_name_extracted, "\""), process_name, "") . case('properties.FileName' == trim(process_args2, "\""), "", isnotnull(process_args2), " " . process_args2, isnotnull(process_args), " " . process_args, 1==1, ""))
EVAL-parent_process = case(category IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), parent_process_name, 1==1, coalesce(parent_process_path_no_filename, "") .  "\\" . coalesce(trim(parent_process_name_extracted, "\""), parent_process_name, "") . case('properties.InitiatingProcessFileName' == trim(parent_process_args2, "\""), "", isnotnull(parent_process_args2), " " . parent_process_args2, isnotnull(parent_process_args), " " . parent_process_args, 1==1, ""))

EVAL-parent_process_exec = replace('properties.InitiatingProcessFolderPath',"(.*\\\)(?=.*(\.\w*)$|(\w+)$)","")
EVAL-process_exec = replace('properties.FolderPath',"(.*\\\)(?=.*(\.\w*)$|(\w+)$)","")


[mscs:azure:eventhub:defender:advancedhunting]
KV_MODE = json
TIME_FORMAT = %Y-%m-%dT%H:%M:%S.%7QZ
TIME_PREFIX = \{"time": "
SEDCMD-remove_prefix = s/^\{"body":\{"records":\s//g
SEDCMD-remove_trailing = s/\}\}\},.+$/}}/g
category = Splunk App Add-on Builder
TRUNCATE = 0
pulldown_type = 1

# Common fields for all datasets
EVAL-dest = case('properties.DeviceName' != "null", 'properties.DeviceName', 1==1, null())
EVAL-action = case(category=="AdvancedHunting-DeviceProcessEvents","allowed", category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileCreated", "created", category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileModified", "modified", category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileDeleted", "deleted", category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileRenamed", "renamed", category=="AdvancedHunting-DeviceRegistryEvents" AND 'properties.ActionType' IN ("RegistryValueDeleted","RegistryKeyDeleted"), "deleted", category=="AdvancedHunting-DeviceRegistryEvents" AND 'properties.ActionType' IN ("RegistryValueSet","RegistryKeyCreated"), "created", category=="AdvancedHunting-EmailEvents",case('properties.DeliveryAction'=="Delivered","delivered",'properties.DeliveryAction'=="Blocked","blocked",'properties.DeliveryAction'=="Junked","deleted",'properties.DeliveryAction'=="Replaced","quarantined",true(),"other"), 1==1, "unknown")
EVAL-app = case(category IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), coalesce('properties.ServiceSource', "Microsoft Defender for Endpoint"), 1==1, null())
EVAL-file_hash = case('properties.MD5' != "null", 'properties.MD5', 'properties.SHA1' != "null", 'properties.SHA1', 'properties.SHA256' != "null", 'properties.SHA256')
EVAL-file_name = case(category IN ("AdvancedHunting-DeviceFileEvents", "AdvancedHunting-EmailAttachmentInfo", "AdvancedHunting-AlertEvidence") AND 'properties.FileName' != "null", 'properties.FileName')
EVAL-signature = case(category IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), 'properties.Title', category=="AdvancedHunting-EmailEvents",if('properties.EmailAction'=="null","No action taken",'properties.EmailAction'), 1==1, null())
EVAL-user = case(category IN ("AdvancedHunting-DeviceProcessEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence") AND 'properties.AccountName' != "null", 'properties.AccountName', category=="AdvancedHunting-DeviceImageLoadEvents", 'properties.InitiatingProcessAccountName', category=="AdvancedHunting-DeviceNetworkEvents", 'properties.InitiatingProcessAccountName', category=="AdvancedHunting-DeviceFileEvents", 'properties.InitiatingProcessAccountName', category=="AdvancedHunting-DeviceRegistryEvents", 'properties.InitiatingProcessAccountName', category=="AdvancedHunting-DeviceAlertEvents",'properties.AccountName')
EVAL-vendor_product = "Microsoft Defender for Endpoint"
EVAL-src = case(category=="AdvancedHunting-DeviceNetworkEvents", 'properties.Timestamp', category=="AdvancedHunting-EmailEvents", 'properties.SenderIPv4')

# Alerts node
# Does not work. Bug SPL-205994 to be fixed in 8.3.0
# Error in 'eval' command: The arguments to the 'mvmap' function are invalid.
#EVAL-mitre_technique_id = mvmap(json_array_to_mv('properties.MitreTechniques'), replace('properties.MitreTechniques', "(.+)\((\S+)\)$", "\2"))
# mitre_technique_name is not a CIM field, but useful perhaps
EVAL-mitre_technique_name = json_array_to_mv('properties.AttackTechniques')
EVAL-id = case(category IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), 'properties.AlertId', 1==1, null())
EVAL-severity = case(category IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), lower('properties.Severity'), 1==1, null())
EVAL-type = case(category IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), "alert", 1==1, null())
EVAL-description = case(category IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertEvidence"), 'properties.AdditionalFields', 1==1, null())
EVAL-vendor_account = case(category IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), 'properties.tenantId', 1==1, null())

# Email node
EVAL-filter_action = case(category=="AdvancedHunting-EmailEvents",'properties.EmailActionPolicy')
EVAL-internal_message_id = case(category IN ("AdvancedHunting-EmailEvents","AdvancedHunting-EmailAttachmentInfo"),'properties.NetworkMessageId')
EVAL-message_id = case(category=="AdvancedHunting-EmailEvents",'properties.InternetMessageId')
EVAL-message_info = case(category=="AdvancedHunting-EmailEvents",'properties.ConfidenceLevel')
EVAL-recipient = case(category IN ("AdvancedHunting-EmailEvents","AdvancedHunting-EmailAttachmentInfo"),'properties.RecipientEmailAddress')
EVAL-recipient_count =  case(category IN ("AdvancedHunting-EmailEvents","AdvancedHunting-EmailAttachmentInfo"),mvcount('properties.RecipientEmailAddress'))
EVAL-recipient_domain = case(category IN ("AdvancedHunting-EmailEvents","AdvancedHunting-EmailAttachmentInfo"),replace('properties.RecipientEmailAddress',"[^@]+@(.*)","\1"))
EVAL-signature_extra = case(category=="AdvancedHunting-EmailEvents",'properties.DetectionMethods')
EVAL-signature_id = case(category=="AdvancedHunting-EmailEvents",'properties.EmailActionPolicyGuid')
EVAL-src_user = case(category IN ("AdvancedHunting-EmailEvents","AdvancedHunting-EmailAttachmentInfo"),'properties.SenderFromAddress')
EVAL-src_user_domain = case(category IN ("AdvancedHunting-EmailEvents","AdvancedHunting-EmailAttachmentInfo"),replace('properties.SenderFromAddress',"[^@]+@(.*)","\1"))
EVAL-subject = case(category=="AdvancedHunting-EmailEvents",'properties.Subject')

# DNS node
# Not applicable

# Ports node
EVAL-dest_ip = case('properties.LocalIP' != "null", 'properties.LocalIP', 1==1, null())
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_ports_dest_port = properties.LocalPort as dest_port
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_ports_src_port = properties.RemotePort as src_port
EVAL-creation_time = case(category=="AdvancedHunting-DeviceNetworkEvents",'properties.Timestamp')
EVAL-state = case(category=="AdvancedHunting-DeviceNetworkEvents","listening")
EVAL-transport = lower('properties.Protocol')

# Filesystem node
EVAL-file_access_time = case(category=="AdvancedHunting-DeviceFileEvents",'properties.Timestamp')
EVAL-file_acl = case(category=="AdvancedHunting-DeviceFileEvents",'properties.InitiatingProcessTokenElevation')
EVAL-file_create_time = case(category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileCreated",'properties.Timestamp')
EVAL-file_modify_time = case(category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileModified",'properties.Timestamp')
EVAL-file_path = case(category=="AdvancedHunting-DeviceFileEvents",'properties.FolderPath')
EVAL-file_size = case(category=="AdvancedHunting-DeviceFileEvents" AND 'properties.FileSize' != "null",'properties.FileSize')

# Registry node
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_registry = properties.RegistryValueType as registry_value_type
EVAL-registry_hive = case(category=="AdvancedHunting-DeviceRegistryEvents", if(isnull('properties.RegistryKey') OR 'properties.RegistryKey'="", replace('properties.PreviousRegistryKey',"(HKEY[_\w]+(\\\\(SAM|SECURITY|SOFTWARE|SYSTEM|\.DEFAULT))?).*","\1"), replace('properties.RegistryKey',"(HKEY[_\w]+(\\\\(SAM|SECURITY|SOFTWARE|SYSTEM|\.DEFAULT))?).*","\1")))
EVAL-registry_key_name = case(category=="AdvancedHunting-DeviceRegistryEvents", replace('properties.RegistryKey',".+\\\\",""))
EVAL-registry_path = case(category=="AdvancedHunting-DeviceRegistryEvents", if(isnull('properties.RegistryKey') OR 'properties.RegistryKey'="", 'properties.PreviousRegistryKey', 'properties.RegistryKey'))
EVAL-registry_value_name = case(category=="AdvancedHunting-DeviceRegistryEvents", 'properties.RegistryValueName')
EVAL-registry_value_type = case(category=="AdvancedHunting-DeviceRegistryEvents", 'properties.RegistryValueType')

# Processes node
REPORT-0defender-process-parent_process_name_args = defender-process-parent_process_name_args
REPORT-0defender-process-parent_process_path_no_filename = defender-process-parent_process_path_no_filename
REPORT-0defender-process-process_name_args = defender-process-process_name_args
REPORT-0defender-process-process_path_no_filename = defender-process-process_path_no_filename

EVAL-cmdline = case('properties.ProcessCommandLine' != "null", 'properties.ProcessCommandLine', 1==1, null())
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_parent_process_id = properties.InitiatingProcessId AS parent_process_id
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_parent_process_name = properties.InitiatingProcessFileName AS parent_process_name
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_parent_process_path = properties.InitiatingProcessFolderPath AS parent_process_path
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_process_id = properties.ProcessId as process_id
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_process_integrity_level = properties.ProcessIntegrityLevel AS process_integrity_level
EVAL-process_name = case('properties.FileName' != "null", 'properties.FileName', 1==1, null())
EVAL-process_path = case('properties.FolderPath' != "null", 'properties.FolderPath', 1==1, null())
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_user_id = properties.AccountUpn AS user_id

EVAL-process_hash = "MD5=" . 'properties.MD5' . ",SHA1=" . 'properties.SHA1' . ",SHA256=" . 'properties.SHA256'
EVAL-parent_process_hash = "MD5=" . 'properties.InitiatingProcessMD5' . ",SHA1=" . 'properties.InitiatingProcessSHA1' . ",SHA256=" . 'properties.InitiatingProcessSHA256'
# Not 100% sure about these two
EVAL-process_guid = case('properties.AccountObjectId' == "null", null(), isnotnull('properties.AccountObjectId'), "{" . upper('properties.AccountObjectId') . "}")
EVAL-parent_process_guid = case('properties.InitiatingProcessAccountObjectId' == "null", null(), isnotnull('properties.InitiatingProcessAccountObjectId'), "{" . upper('properties.InitiatingProcessAccountObjectId') . "}")
# I am making a lot of assumptions here
EVAL-process = case(category IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), if(process_name != "null", process_name, null()), 1==1, coalesce(process_path_no_filename, "") .  "\\" . coalesce(trim(process_name_extracted, "\""), process_name, "") . case('properties.FileName' == trim(process_args2, "\""), "", isnotnull(process_args2), " " . process_args2, isnotnull(process_args), " " . process_args, 1==1, ""))
EVAL-parent_process = case(category IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), parent_process_name, 1==1, coalesce(parent_process_path_no_filename, "") .  "\\" . coalesce(trim(parent_process_name_extracted, "\""), parent_process_name, "") . case('properties.InitiatingProcessFileName' == trim(parent_process_args2, "\""), "", isnotnull(parent_process_args2), " " . parent_process_args2, isnotnull(parent_process_args), " " . parent_process_args, 1==1, ""))

EVAL-parent_process_exec = replace('properties.InitiatingProcessFolderPath',"(.*\\\)(?=.*(\.\w*)$|(\w+)$)","")
EVAL-process_exec = replace('properties.FolderPath',"(.*\\\)(?=.*(\.\w*)$|(\w+)$)","")

