[source::azure_event_hub://Defender_Security_Center]
# DNS node
# Not applicable
KV_MODE = json
TIME_FORMAT = %Y-%m-%dT%H:%M:%S.%7QZ
TIME_PREFIX = \{"time": "
category = Splunk App Add-on Builder
pulldown_type = 1


# Common fields for all datasets
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_common_dest = properties.DeviceName AS dest
EVAL-action = case(category=="AdvancedHunting-DeviceProcessEvents","allowed", category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileCreated", "created", category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileModified", "modified", category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileDeleted", "deleted", category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileRenamed", "renamed", category=="AdvancedHunting-DeviceRegistryEvents" AND in('properties.ActionType',"RegistryValueDeleted","RegistryKeyDeleted"), "deleted", category=="AdvancedHunting-DeviceRegistryEvents" AND in('properties.ActionType',"RegistryValueSet","RegistryKeyCreated"), "created", 1==1, "unknown")
EVAL-user = case(category=="AdvancedHunting-DeviceProcessEvents", 'properties.AccountName', category=="AdvancedHunting-DeviceImageLoadEvents", 'properties.InitiatingProcessAccountName', category=="AdvancedHunting-DeviceNetworkEvents", 'properties.InitiatingProcessAccountName', category=="AdvancedHunting-DeviceFileEvents", 'properties.InitiatingProcessAccountName', category=="AdvancedHunting-DeviceRegistryEvents", 'properties.InitiatingProcessAccountName')
EVAL-vendor_product = "Microsoft Defender for Endpoint"

# Ports node
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_ports_dest_ip = properties.LocalIP AS dest_ip
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_ports_dest_port = properties.LocalPort as dest_port
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_ports_src = properties.RemoteIP AS src
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_ports_src_port = properties.RemotePort as src_port
EVAL-creation_time = case(category=="AdvancedHunting-DeviceNetworkEvents",'properties.Timestamp')
EVAL-state = case(category=="AdvancedHunting-DeviceNetworkEvents","listening")
EVAL-transport = lower('properties.Protocol')

# Filesystem node
EVAL-file_access_time = case(category=="AdvancedHunting-DeviceFileEvents",'properties.Timestamp')
EVAL-file_acl = case(category=="AdvancedHunting-DeviceFileEvents",'properties.InitiatingProcessTokenElevation')
EVAL-file_create_time = case(category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileCreated",'properties.Timestamp')
EVAL-file_hash = case('properties.MD5' != "null", 'properties.MD5', 'properties.SHA1' != "null", 'properties.SHA1', 'properties.SHA256' != "null", 'properties.SHA256')
EVAL-file_modify_time = case(category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileModified",'properties.Timestamp')
EVAL-file_name = case(category=="AdvancedHunting-DeviceFileEvents",'properties.FileName')
EVAL-file_path = case(category=="AdvancedHunting-DeviceFileEvents",'properties.FolderPath')
EVAL-file_size = case(category=="AdvancedHunting-DeviceFileEvents" AND 'properties.FileSize' != "null",'properties.FileSize')

# Registry node
REPORT-0defender-registry-path = defender-registry-path
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_registry = properties.RegistryValueType as registry_value_type
EVAL-registry_hive = case(category=="AdvancedHunting-DeviceRegistryEvents", if(isnull('properties.RegistryKey') OR 'properties.RegistryKey'="", replace('properties.PreviousRegistryKey',"(HKEY[_\w]+(\\\\(SAM|SECURITY|SOFTWARE|SYSTEM|\.DEFAULT))?).*","\1"), replace('properties.RegistryKey',"(HKEY[_\w]+(\\\\(SAM|SECURITY|SOFTWARE|SYSTEM|\.DEFAULT))?).*","\1")))
EVAL-registry_key_name = case(category=="AdvancedHunting-DeviceRegistryEvents", replace('properties.RegistryKey',".+\\\\",""))
EVAL-registry_path = case(category=="AdvancedHunting-DeviceRegistryEvents", if(isnull('properties.RegistryKey') OR 'properties.RegistryKey'="", 'properties.PreviousRegistryKey', 'properties.RegistryKey'))
EVAL-registry_value_name = case(category=="AdvancedHunting-DeviceRegistryEvents", 'properties.RegistryValueName')
EVAL-registry_value_type = case(category=="AdvancedHunting-DeviceRegistryEvents", 'properties.RegistryValueType')

# Processes node
REPORT-0defender-process-parent_process_name_args = defender-process-parent_process_name_args
REPORT-0defender-process-parent_process_path_no_filename = defender-process-parent_process_path_no_filename
REPORT-0defender-process-process_name_args = defender-process-process_name_args
REPORT-0defender-process-process_path_no_filename = defender-process-process_path_no_filename

FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_cmdline = properties.ProcessCommandLine AS cmdline
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_parent_process_id = properties.InitiatingProcessId AS parent_process_id
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_parent_process_name = properties.InitiatingProcessFileName AS parent_process_name
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_parent_process_path = properties.InitiatingProcessFolderPath AS parent_process_path
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_process_id = properties.ProcessId as process_id
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_process_integrity_level = properties.ProcessIntegrityLevel AS process_integrity_level
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_process_name = properties.FileName AS process_name
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_process_path = properties.FolderPath AS process_path
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_user_id = properties.AccountUpn AS user_id

EVAL-process_hash = "MD5=" . 'properties.MD5' . ",SHA1=" . 'properties.SHA1' . ",SHA256=" . 'properties.SHA256'
EVAL-parent_process_hash = "MD5=" . 'properties.InitiatingProcessMD5' . ",SHA1=" . 'properties.InitiatingProcessSHA1' . ",SHA256=" . 'properties.InitiatingProcessSHA256'
# Not 100% sure about these two
EVAL-process_guid = case('properties.AccountObjectId' == "null", null(), isnotnull('properties.AccountObjectId'), "{" . upper('properties.AccountObjectId') . "}")
EVAL-parent_process_guid = case('properties.InitiatingProcessAccountObjectId' == "null", null(), isnotnull('properties.InitiatingProcessAccountObjectId'), "{" . upper('properties.InitiatingProcessAccountObjectId') . "}")
# I am making a lot of assumptions here
EVAL-process = coalesce(process_path_no_filename, "") .  "\\" . coalesce(trim(process_name_extracted, "\""), process_name, "") . case('properties.FileName' == trim(process_args2, "\""), "", isnotnull(process_args2), " " . process_args2, isnotnull(process_args), " " . process_args, 1==1, "")
#EVAL-process = coalesce(process_path_no_filename, "") .  "\\" . coalesce(trim(process_name_extracted, "\""), "") . if(isnotnull(process_args), " " . process_args, "")
EVAL-parent_process = coalesce(parent_process_path_no_filename, "") .  "\\" . coalesce(trim(parent_process_name_extracted, "\""), parent_process_name, "") . case('properties.InitiatingProcessFileName' == trim(parent_process_args2, "\""), "", isnotnull(parent_process_args2), " " . parent_process_args2, isnotnull(parent_process_args), " " . parent_process_args, 1==1, "")
#EVAL-parent_process = coalesce(parent_process_path_no_filename, "") .  "\\" . coalesce(trim(parent_process_name_extracted, "\""), "") . if(isnotnull(parent_process_args), " " . parent_process_args, "")

EVAL-parent_process_exec = replace('properties.InitiatingProcessFolderPath',"(.*\\\)(?=.*(\.\w*)$|(\w+)$)","")
EVAL-process_exec = replace('properties.FolderPath',"(.*\\\)(?=.*(\.\w*)$|(\w+)$)","")



[mscs:azure:eventhub:defender:advancedhunting]
# DNS node
# Not applicable
KV_MODE = json
TIME_FORMAT = %Y-%m-%dT%H:%M:%S.%7QZ
TIME_PREFIX = \{"time": "
category = Splunk App Add-on Builder
pulldown_type = 1


# Common fields for all datasets
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_common_dest = properties.DeviceName AS dest
EVAL-action = case(category=="AdvancedHunting-DeviceProcessEvents","allowed", category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileCreated", "created", category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileModified", "modified", category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileDeleted", "deleted", category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileRenamed", "renamed", category=="AdvancedHunting-DeviceRegistryEvents" AND in('properties.ActionType',"RegistryValueDeleted","RegistryKeyDeleted"), "deleted", category=="AdvancedHunting-DeviceRegistryEvents" AND in('properties.ActionType',"RegistryValueSet","RegistryKeyCreated"), "created", 1==1, "unknown")
EVAL-user = case(category=="AdvancedHunting-DeviceProcessEvents", 'properties.AccountName', category=="AdvancedHunting-DeviceImageLoadEvents", 'properties.InitiatingProcessAccountName', category=="AdvancedHunting-DeviceNetworkEvents", 'properties.InitiatingProcessAccountName', category=="AdvancedHunting-DeviceFileEvents", 'properties.InitiatingProcessAccountName', category=="AdvancedHunting-DeviceRegistryEvents", 'properties.InitiatingProcessAccountName')
EVAL-vendor_product = "Microsoft Defender for Endpoint"

# Ports node
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_ports_dest_ip = properties.LocalIP AS dest_ip
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_ports_dest_port = properties.LocalPort as dest_port
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_ports_src = properties.RemoteIP AS src
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_ports_src_port = properties.RemotePort as src_port
EVAL-creation_time = case(category=="AdvancedHunting-DeviceNetworkEvents",'properties.Timestamp')
EVAL-state = case(category=="AdvancedHunting-DeviceNetworkEvents","listening")
EVAL-transport = lower('properties.Protocol')

# Filesystem node
EVAL-file_access_time = case(category=="AdvancedHunting-DeviceFileEvents",'properties.Timestamp')
EVAL-file_acl = case(category=="AdvancedHunting-DeviceFileEvents",'properties.InitiatingProcessTokenElevation')
EVAL-file_create_time = case(category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileCreated",'properties.Timestamp')
EVAL-file_hash = case('properties.MD5' != "null", 'properties.MD5', 'properties.SHA1' != "null", 'properties.SHA1', 'properties.SHA256' != "null", 'properties.SHA256')
EVAL-file_modify_time = case(category=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType' == "FileModified",'properties.Timestamp')
EVAL-file_name = case(category=="AdvancedHunting-DeviceFileEvents",'properties.FileName')
EVAL-file_path = case(category=="AdvancedHunting-DeviceFileEvents",'properties.FolderPath')
EVAL-file_size = case(category=="AdvancedHunting-DeviceFileEvents" AND 'properties.FileSize' != "null",'properties.FileSize')

# Registry node
REPORT-0defender-registry-path = defender-registry-path
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_registry = properties.RegistryValueType as registry_value_type
EVAL-registry_hive = case(category=="AdvancedHunting-DeviceRegistryEvents", if(isnull('properties.RegistryKey') OR 'properties.RegistryKey'="", replace('properties.PreviousRegistryKey',"(HKEY[_\w]+(\\\\(SAM|SECURITY|SOFTWARE|SYSTEM|\.DEFAULT))?).*","\1"), replace('properties.RegistryKey',"(HKEY[_\w]+(\\\\(SAM|SECURITY|SOFTWARE|SYSTEM|\.DEFAULT))?).*","\1")))
EVAL-registry_key_name = case(category=="AdvancedHunting-DeviceRegistryEvents", replace('properties.RegistryKey',".+\\\\",""))
EVAL-registry_path = case(category=="AdvancedHunting-DeviceRegistryEvents", if(isnull('properties.RegistryKey') OR 'properties.RegistryKey'="", 'properties.PreviousRegistryKey', 'properties.RegistryKey'))
EVAL-registry_value_name = case(category=="AdvancedHunting-DeviceRegistryEvents", 'properties.RegistryValueName')
EVAL-registry_value_type = case(category=="AdvancedHunting-DeviceRegistryEvents", 'properties.RegistryValueType')

# Processes node
REPORT-0defender-process-parent_process_name_args = defender-process-parent_process_name_args
REPORT-0defender-process-parent_process_path_no_filename = defender-process-parent_process_path_no_filename
REPORT-0defender-process-process_name_args = defender-process-process_name_args
REPORT-0defender-process-process_path_no_filename = defender-process-process_path_no_filename

FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_cmdline = properties.ProcessCommandLine AS cmdline
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_parent_process_id = properties.InitiatingProcessId AS parent_process_id
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_parent_process_name = properties.InitiatingProcessFileName AS parent_process_name
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_parent_process_path = properties.InitiatingProcessFolderPath AS parent_process_path
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_process_id = properties.ProcessId as process_id
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_process_integrity_level = properties.ProcessIntegrityLevel AS process_integrity_level
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_process_name = properties.FileName AS process_name
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_process_path = properties.FolderPath AS process_path
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_user_id = properties.AccountUpn AS user_id

EVAL-process_hash = "MD5=" . 'properties.MD5' . ",SHA1=" . 'properties.SHA1' . ",SHA256=" . 'properties.SHA256'
EVAL-parent_process_hash = "MD5=" . 'properties.InitiatingProcessMD5' . ",SHA1=" . 'properties.InitiatingProcessSHA1' . ",SHA256=" . 'properties.InitiatingProcessSHA256'
# Not 100% sure about these two
EVAL-process_guid = case('properties.AccountObjectId' == "null", null(), isnotnull('properties.AccountObjectId'), "{" . upper('properties.AccountObjectId') . "}")
EVAL-parent_process_guid = case('properties.InitiatingProcessAccountObjectId' == "null", null(), isnotnull('properties.InitiatingProcessAccountObjectId'), "{" . upper('properties.InitiatingProcessAccountObjectId') . "}")
# I am making a lot of assumptions here
EVAL-process = coalesce(process_path_no_filename, "") .  "\\" . coalesce(trim(process_name_extracted, "\""), process_name, "") . case('properties.FileName' == trim(process_args2, "\""), "", isnotnull(process_args2), " " . process_args2, isnotnull(process_args), " " . process_args, 1==1, "")
#EVAL-process = coalesce(process_path_no_filename, "") .  "\\" . coalesce(trim(process_name_extracted, "\""), "") . if(isnotnull(process_args), " " . process_args, "")
EVAL-parent_process = coalesce(parent_process_path_no_filename, "") .  "\\" . coalesce(trim(parent_process_name_extracted, "\""), parent_process_name, "") . case('properties.InitiatingProcessFileName' == trim(parent_process_args2, "\""), "", isnotnull(parent_process_args2), " " . parent_process_args2, isnotnull(parent_process_args), " " . parent_process_args, 1==1, "")
#EVAL-parent_process = coalesce(parent_process_path_no_filename, "") .  "\\" . coalesce(trim(parent_process_name_extracted, "\""), "") . if(isnotnull(parent_process_args), " " . parent_process_args, "")

EVAL-parent_process_exec = replace('properties.InitiatingProcessFolderPath',"(.*\\\)(?=.*(\.\w*)$|(\w+)$)","")
EVAL-process_exec = replace('properties.FolderPath',"(.*\\\)(?=.*(\.\w*)$|(\w+)$)","")

