[mscs:azure:eventhub:defender:advancedhunting]
KV_MODE = json
TIME_PREFIX =  "Timestamp": "
TIME_FORMAT = %Y-%m-%dT%H:%M:%S.%3Q
TZ = UTC
# As of MSCS add-on 4.3.3 we no longer require this
#SEDCMD-remove_prefix = s/^\{"body":\{"records":\s?//g
#SEDCMD-remove_trailing = s/\}\}\},.+$/}}/g
#
category = Splunk App Add-on Builder
TRUNCATE = 0
pulldown_type = 1

# Backwards compatibility prior to MSCS Add-on 4.3.3
EVAL-category = coalesce(category,'body.category')

# Common fields for all datasets
LOOKUP-ms_365_defender_vendor_description = ms_365_defender_vendor_description ActionType AS properties.ActionType OUTPUT vendor_description

EVAL-dest = case(coalesce('properties.DeviceName','body.properties.DeviceName') != "null", coalesce('properties.DeviceName','body.properties.DeviceName'), 1==1, null())

# From Microsoft Security Add-on 2.5.4 to fix Network Traffic CIM action field
# Common fields
EVAL-action = if('category'=="AdvancedHunting-DeviceProcessEvents" AND 'properties.ActionType'=="ProcessCreated", "created", \
        if('category'=="AdvancedHunting-DeviceRegistryEvents" AND IN('properties.ActionType', "RegistryValueDeleted", "RegistryKeyDeleted"), "deleted", \
        if('category'=="AdvancedHunting-DeviceRegistryEvents" AND IN('properties.ActionType', "RegistryValueSet", "RegistryKeyCreated"), "created", \
        if('category'=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType'=="FileCreated", "created", \
        if('category'=="AdvancedHunting-DeviceFileEvents" AND IN('properties.ActionType', "FileModified", "FileRenamed"), "modified", \
        if('category'=="AdvancedHunting-DeviceFileEvents" AND 'properties.ActionType'=="FileDeleted", "deleted", \
        if('category'=="AdvancedHunting-DeviceEvents" AND isnotnull('properties.ActionType'), "allowed", \
        if('category'=="AdvancedHunting-DeviceLogonEvents" AND 'properties.ActionType'=="LogonFailed", "blocked", \
        if('category'=="AdvancedHunting-DeviceLogonEvents" AND IN('properties.ActionType', "LogonSuccess", "LogonAttempted"), "allowed", \
        if('category'=="AdvancedHunting-DeviceNetworkEvents" AND 'properties.ActionType'=="ConnectionFailed", "blocked", \
        if('category'=="AdvancedHunting-DeviceNetworkEvents" AND IN('properties.ActionType', "ConnectionSuccess", "InboundConnectionAccepted", "ConnectionRequest", "InboundInternetScanInspected"), "allowed", \
        if('category'=="AdvancedHunting-UrlClickEvents", 'properties.ActionType', \
        if('category'=="AdvancedHunting-DeviceImageLoadEvents" AND 'properties.ActionType'=="ImageLoaded", "read", null())))))))))))))

EVAL-app = case(coalesce(category,'body.category')="AdvancedHunting-UrlClickEvents", coalesce('properties.Workload','body.properties.Workload'), coalesce(category,'body.category') IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), coalesce('properties.ServiceSource', 'body.properties.ServiceSource', "Microsoft Defender for Endpoint"), 1==1, null())
EVAL-file_hash = case(coalesce('properties.SHA256','body.properties.SHA256') != "null", coalesce('properties.SHA256','body.properties.SHA256'), coalesce('properties.SHA1','body.properties.SHA1') != "null", coalesce('properties.SHA1','body.properties.SHA1'), coalesce('properties.MD5','body.properties.MD5') != "null", coalesce('properties.MD5','body.properties.MD5'))
EVAL-file_name = case(coalesce(category,'body.category') IN ("AdvancedHunting-DeviceFileEvents", "AdvancedHunting-EmailAttachmentInfo", "AdvancedHunting-AlertEvidence") AND coalesce('properties.FileName','body.properties.FileName') != "null", coalesce('properties.FileName','body.properties.FileName'))
EVAL-file_size = case(coalesce(category,'body.category') IN ("AdvancedHunting-DeviceFileEvents","AdvancedHunting-EmailAttachmentInfo") AND coalesce('properties.FileSize','body.properties.FileSize') != "null",coalesce('properties.FileSize','body.properties.FileSize'))
EVAL-signature = case(coalesce(category,'body.category') IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), coalesce('properties.Title','body.properties.Title'), coalesce(category,'body.category')=="AdvancedHunting-EmailEvents",if(coalesce('properties.EmailAction','body.properties.EmailAction')=="null","No action taken",coalesce('properties.EmailAction','body.properties.EmailAction')), 1==1, null())

EVAL-user = case(coalesce(category,'body.category') IN ("AdvancedHunting-DeviceProcessEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence") AND coalesce('properties.AccountName','body.properties.AccountName') != "null", coalesce('properties.AccountName','body.properties.AccountName'), coalesce(category,'body.category')="AdvancedHunting-UrlClickEvents", coalesce('properties.AccountUpn','body.properties.AccountUpn'), coalesce(category,'body.category')=="AdvancedHunting-DeviceImageLoadEvents", coalesce('properties.InitiatingProcessAccountName','body.properties.InitiatingProcessAccountName'), coalesce(category,'body.category')=="AdvancedHunting-DeviceImageLoadEvents", coalesce('properties.InitiatingProcessAccountName','body.properties.InitiatingProcessAccountName'), coalesce(category,'body.category')=="AdvancedHunting-DeviceNetworkEvents", coalesce('properties.InitiatingProcessAccountName','body.properties.InitiatingProcessAccountName'), coalesce(category,'body.category')=="AdvancedHunting-DeviceFileEvents", coalesce('properties.InitiatingProcessAccountName','body.properties.InitiatingProcessAccountName'), coalesce(category,'body.category')=="AdvancedHunting-DeviceRegistryEvents", coalesce('properties.InitiatingProcessAccountName','body.properties.InitiatingProcessAccountName'), coalesce(category,'body.category')=="AdvancedHunting-DeviceAlertEvents",coalesce('properties.AccountName','body.properties.AccountName'), coalesce(category,'body.category')=="AdvancedHunting-AlertEvidence", json_extract(coalesce('properties.AdditionalFields','body.properties.AdditionalFields'),"Account.Name"))

EVAL-vendor_product = case(coalesce('properties.ServiceSource','body.properties.ServiceSource','properties.Vendor','body.properties.Vendor','properties.NetworkAdapterVendor','body.properties.NetworkAdapterVendor') != "null" AND coalesce('properties.ServiceSource','body.properties.ServiceSource','properties.Vendor','body.properties.Vendor','properties.NetworkAdapterVendor','body.properties.NetworkAdapterVendor') != "", coalesce('properties.ServiceSource','body.properties.ServiceSource','properties.Vendor','body.properties.Vendor','properties.NetworkAdapterVendor','properties.NetworkAdapterVendor'), 1=1, "Microsoft Defender for Endpoint")

EVAL-src = case(coalesce(category,'body.category')="AdvancedHunting-UrlClickEvents" AND coalesce('properties.IPAddress','body.properties.IPAddress')!="127.0.0.1" AND coalesce('properties.IPAddress','body.properties.IPAddress')!="::1" AND coalesce('properties.IPAddress','body.properties.IPAddress')!="null", coalesce('properties.IPAddress','body.properties.IPAddress'),coalesce(category,'body.category')=="AdvancedHunting-DeviceNetworkEvents", ltrim(coalesce('properties.LocalIP','body.properties.LocalIP'),"::ffff:"), coalesce(category,'body.category')=="AdvancedHunting-EmailEvents", coalesce('properties.SenderIPv4','body.properties.SenderIPv4'))

EVAL-src_ip = case(coalesce(category,'body.category')="AdvancedHunting-UrlClickEvents" AND coalesce('properties.IPAddress','body.properties.IPAddress')!="127.0.0.1" AND coalesce('properties.IPAddress','body.properties.IPAddress')!="::1" AND coalesce('properties.IPAddress','body.properties.IPAddress')!="null", coalesce('properties.IPAddress','body.properties.IPAddress'),coalesce(category,'body.category')=="AdvancedHunting-DeviceNetworkEvents" AND coalesce('properties.ActionType','body.properties.ActionType') != "ConnectionAcknowledged", ltrim(coalesce('properties.LocalIP','body.properties.LocalIP'),"::ffff:"), coalesce(category,'body.category')=="AdvancedHunting-DeviceNetworkEvents", ltrim(coalesce('properties.RemoteIP','body.properties.RemoteIP'),"::ffff:"), coalesce(category,'body.category')=="AdvancedHunting-EmailEvents", coalesce('properties.SenderIPv4','body.properties.SenderIPv4'))

EVAL-file_path = case(coalesce(category,'body.category') IN ("AdvancedHunting-DeviceFileEvents", "AdvancedHunting-AlertEvidence"),coalesce('properties.FolderPath','body.properties.FolderPath'))
EVAL-object_category = case(coalesce(category,'body.category')=="AdvancedHunting-DeviceFileEvents", "file", coalesce(category,'body.category')=="AdvancedHunting-DeviceRegistryEvents", "registry")

# Alerts node
# Coalesce doesn't work with mvmap. Backwards compatibility not possible
EVAL-mitre_technique_id = mvmap(json_array_to_mv('body.properties.AttackTechniques'), replace('body.properties.AttackTechniques', "(.+)\((\S+)\)$", "\2"))
# mitre_technique_name and description are not CIM fields, but useful perhaps
EVAL-mitre_technique_description = mvmap(json_array_to_mv('body.properties.AttackTechniques'), replace('body.properties.AttackTechniques', "(.+)\((\S+)\)$", "\1"))
EVAL-mitre_technique_name = json_array_to_mv('body.properties.AttackTechniques')
EVAL-id = case(coalesce(category,'body.category') IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), coalesce('properties.AlertId','body.properties.AlertId'), 1==1, null())
EVAL-severity = case(coalesce(category,'body.category') IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), lower(coalesce('properties.Severity','body.properties.Severity')), 1==1, null())
EVAL-type = case(coalesce(category,'body.category') IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), "alert", 1==1, null())
EVAL-description = case(coalesce(category,'body.category') IN ("AdvancedHunting-DeviceInfo", "AdvancedHunting-DeviceNetworkInfo"), "Microsoft 365 Defender", coalesce(category,'body.category') IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertEvidence"), coalesce('properties.AdditionalFields','body.properties.AdditionalFields'), 1==1, null())

EVAL-vendor_account = case(coalesce(category,'body.category') IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), coalesce('properties.tenantId','body.properties.tenantId'), 1==1, null())

# Email node
EVAL-filter_action = case(coalesce(category,'body.category')=="AdvancedHunting-EmailEvents",coalesce('properties.EmailActionPolicy','body.properties.EmailActionPolicy'))
EVAL-internal_message_id = case(coalesce(category,'body.category') IN ("AdvancedHunting-EmailEvents","AdvancedHunting-EmailAttachmentInfo"),coalesce('properties.NetworkMessageId','body.properties.NetworkMessageId'))
EVAL-message_id = case(coalesce(category,'body.category')=="AdvancedHunting-EmailEvents",coalesce('properties.InternetMessageId','body.properties.InternetMessageId'))
EVAL-message_info = case(coalesce(category,'body.category')=="AdvancedHunting-EmailEvents",coalesce('properties.ConfidenceLevel','body.properties.ConfidenceLevel'))
EVAL-recipient = case(coalesce(category,'body.category') IN ("AdvancedHunting-EmailEvents","AdvancedHunting-EmailAttachmentInfo"),coalesce('properties.RecipientEmailAddress','body.properties.RecipientEmailAddress'))
EVAL-recipient_count =  case(coalesce(category,'body.category') IN ("AdvancedHunting-EmailEvents","AdvancedHunting-EmailAttachmentInfo"),mvcount(coalesce('properties.RecipientEmailAddress','body.properties.RecipientEmailAddress')))
EVAL-recipient_domain = case(coalesce(category,'body.category') IN ("AdvancedHunting-EmailEvents","AdvancedHunting-EmailAttachmentInfo"),replace(coalesce('properties.RecipientEmailAddress','body.properties.RecipientEmailAddress'),"[^@]+@(.*)","\1"))
EVAL-signature_extra = case(coalesce(category,'body.category')=="AdvancedHunting-EmailEvents",coalesce('properties.DetectionMethods','body.properties.DetectionMethods'))
EVAL-signature_id = case(coalesce(category,'body.category')=="AdvancedHunting-EmailEvents",coalesce('properties.EmailActionPolicyGuid','body.properties.EmailActionPolicyGuid'))
EVAL-src_user = case(coalesce(category,'body.category') IN ("AdvancedHunting-EmailEvents","AdvancedHunting-EmailAttachmentInfo"),coalesce('properties.SenderFromAddress','body.properties.SenderFromAddress'))
EVAL-src_user_domain = case(coalesce(category,'body.category') IN ("AdvancedHunting-EmailEvents","AdvancedHunting-EmailAttachmentInfo"),replace(coalesce('properties.SenderFromAddress','body.properties.SenderFromAddress'),"[^@]+@(.*)","\1"))
EVAL-subject = case(coalesce(category,'body.category')=="AdvancedHunting-EmailEvents",coalesce('properties.Subject','body.properties.Subject'))

# DNS node
# Not applicable

# Ports node
# Should be properties.RemoteIP for AdvancedHunting-DeviceNetworkEvents
EVAL-dest_ip = case(coalesce(category,'body.category')=="AdvancedHunting-DeviceNetworkEvents" AND coalesce('properties.RemoteIP','body.properties.RemoteIP') != "null" AND coalesce('properties.ActionType','body.properties.ActionType') != "ConnectionAcknowledged", ltrim(coalesce('properties.RemoteIP','body.properties.RemoteIP'),"::ffff:"), coalesce('properties.LocalIP','body.properties.LocalIP') != "null", ltrim(coalesce('properties.LocalIP','body.properties.LocalIP'),"::ffff:"), 1==1, null())
#EVAL-dest_port = coalesce('properties.LocalPort','body.properties.LocalPort')
EVAL-dest_port = case(coalesce(category,'body.category')=="AdvancedHunting-DeviceNetworkEvents" AND coalesce('properties.RemotePort','body.properties.RemotePort') != "null" AND coalesce('properties.ActionType','body.properties.ActionType') != "ConnectionAcknowledged", coalesce('properties.RemotePort','body.properties.RemotePort'), 1==1, coalesce('properties.LocalPort','body.properties.LocalPort'))
#EVAL-src_port = coalesce('properties.RemotePort','body.properties.RemotePort')
EVAL-src_port = case(coalesce(category,'body.category')=="AdvancedHunting-DeviceNetworkEvents" AND coalesce('properties.LocalPort','body.properties.LocalPort') != "null" AND coalesce('properties.ActionType','body.properties.ActionType') != "ConnectionAcknowledged", coalesce('properties.LocalPort','body.properties.LocalPort'), 1==1, coalesce('properties.RemotePort','body.properties.RemotePort'))
EVAL-creation_time = case(coalesce(category,'body.category')=="AdvancedHunting-DeviceNetworkEvents",coalesce('properties.Timestamp','body.properties.Timestamp'))
EVAL-state = case(coalesce(category,'body.category')=="AdvancedHunting-DeviceNetworkEvents","listening")
EVAL-transport = lower(coalesce('properties.Protocol','body.properties.Protocol'))

EVAL-src_mac = case(coalesce(category,'body.category')=="AdvancedHunting-DeviceNetworkEvents", json_extract('properties.AdditionalFields',"Source Mac"), 1==1, null())
EVAL-dest_mac = case(coalesce(category,'body.category')=="AdvancedHunting-DeviceNetworkEvents", json_extract('properties.AdditionalFields',"Destination Mac"), 1==1, null())

EVAL-tcp_flag = case(coalesce(category,'body.category')=="AdvancedHunting-DeviceNetworkEvents", json_extract(lookup("ms_365_defender_tcp_flag", json_object("tcp_flag_hex", json_extract('properties.AdditionalFields',"Tcp Flags")), json_array("tcp_flag")), "tcp_flag"), 1==1, null())

# Filesystem node
EVAL-file_access_time = case(coalesce(category,'body.category')=="AdvancedHunting-DeviceFileEvents",coalesce('properties.Timestamp','body.properties.Timestamp'))
EVAL-file_acl = case(coalesce(category,'body.category')=="AdvancedHunting-DeviceFileEvents",coalesce('properties.InitiatingProcessTokenElevation','body.properties.InitiatingProcessTokenElevation'))
EVAL-file_create_time = case(coalesce(category,'body.category')=="AdvancedHunting-DeviceFileEvents" AND coalesce('properties.ActionType','body.properties.ActionType') == "FileCreated",coalesce('properties.Timestamp','body.properties.Timestamp'))
EVAL-file_modify_time = case(coalesce(category,'body.category')=="AdvancedHunting-DeviceFileEvents" AND coalesce('properties.ActionType','body.properties.ActionType') == "FileModified",coalesce('properties.Timestamp','body.properties.Timestamp'))

# Registry node
EVAL-registry_hive = case(coalesce(category,'body.category')=="AdvancedHunting-DeviceRegistryEvents", if(isnull(coalesce('properties.RegistryKey','body.properties.RegistryKey')) OR coalesce('properties.RegistryKey','body.properties.RegistryKey')="", replace(coalesce('properties.PreviousRegistryKey','body.properties.PreviousRegistryKey'),"(HKEY[_\w]+(\\\\(SAM|SECURITY|SOFTWARE|SYSTEM|\.DEFAULT))?).*","\1"), replace(coalesce('properties.RegistryKey','body.properties.RegistryKey'),"(HKEY[_\w]+(\\\\(SAM|SECURITY|SOFTWARE|SYSTEM|\.DEFAULT))?).*","\1")))
EVAL-registry_key_name = case(coalesce(category,'body.category')=="AdvancedHunting-DeviceRegistryEvents", replace(coalesce('properties.RegistryKey','body.properties.RegistryKey'),".+\\\\",""))
EVAL-registry_path = case(coalesce(category,'body.category')=="AdvancedHunting-DeviceRegistryEvents", if(isnull(coalesce('properties.RegistryKey','body.properties.RegistryKey')) OR coalesce('properties.RegistryKey','body.properties.RegistryKey')="", coalesce('properties.PreviousRegistryKey','body.properties.PreviousRegistryKey'), coalesce('properties.RegistryKey','body.properties.RegistryKey')))
EVAL-registry_value_name = case(coalesce(category,'body.category')=="AdvancedHunting-DeviceRegistryEvents", coalesce('properties.RegistryValueName','body.properties.RegistryValueName'))
EVAL-registry_value_type = case(coalesce(category,'body.category')=="AdvancedHunting-DeviceRegistryEvents", coalesce('properties.RegistryValueType','body.properties.RegistryValueType'))
EVAL-registry_value_data = case(coalesce(category,'body.category')=="AdvancedHunting-DeviceRegistryEvents" AND coalesce('properties.RegistryValueData','body.properties.RegistryValueData') != "null", coalesce('properties.RegistryValueData','body.properties.RegistryValueData'), true(), null())

# Processes node
REPORT-0defender-process-parent_process_name_args = defender-process-parent_process_name_args, defender-process-parent_process_name_args-body
REPORT-0defender-process-parent_process_path_no_filename = defender-process-parent_process_path_no_filename, defender-process-parent_process_path_no_filename-body
REPORT-0defender-process-process_name_args = defender-process-process_name_args, defender-process-process_name_args-body
REPORT-0defender-process-process_path_no_filename = defender-process-process_path_no_filename, defender-process-process_path_no_filename-body

EVAL-cmdline = case(coalesce('properties.ProcessCommandLine','body.properties.ProcessCommandLine') != "null", coalesce('properties.ProcessCommandLine','body.properties.ProcessCommandLine'), 1==1, null())
EVAL-parent_process_id = coalesce('properties.InitiatingProcessId','body.properties.InitiatingProcessId')
EVAL-parent_process_name = coalesce('properties.InitiatingProcessFileName','body.properties.InitiatingProcessFileName')
EVAL-parent_process_path = coalesce('properties.InitiatingProcessFolderPath','body.properties.InitiatingProcessFolderPath')
EVAL-process_id = coalesce('properties.ProcessId','body.properties.ProcessId')
EVAL-process_integrity_level = coalesce('properties.ProcessIntegrityLevel','body.properties.ProcessIntegrityLevel','properties.InitiatingProcessIntegrityLevel')
EVAL-process_name = case(coalesce('properties.FileName','body.properties.FileName') != "null", coalesce('properties.FileName','body.properties.FileName'), 1==1, null())
EVAL-process_path = case(coalesce('properties.FolderPath','body.properties.FolderPath') != "null", coalesce('properties.FolderPath','body.properties.FolderPath'), 1==1, null())
EVAL-user_id = coalesce('properties.AccountUpn','body.properties.AccountUpn')

EVAL-process_hash = "MD5=" . coalesce('properties.MD5','body.properties.MD5') . ",SHA1=" . coalesce('properties.SHA1','body.properties.SHA1') . ",SHA256=" . coalesce('properties.SHA256','body.properties.SHA256')
EVAL-parent_process_hash = "MD5=" . coalesce('properties.InitiatingProcessMD5','body.properties.InitiatingProcessMD5') . ",SHA1=" . coalesce('properties.InitiatingProcessSHA1','body.properties.InitiatingProcessSHA1') . ",SHA256=" . coalesce('properties.InitiatingProcessSHA256','body.properties.InitiatingProcessSHA256')
# Not 100% sure about these two
EVAL-process_guid = case(coalesce('properties.AccountObjectId','body.properties.AccountObjectId') == "null", null(), isnotnull(coalesce('properties.AccountObjectId','body.properties.AccountObjectId')), "{" . upper(coalesce('properties.AccountObjectId','body.properties.AccountObjectId')) . "}")
EVAL-parent_process_guid = case(coalesce('properties.InitiatingProcessAccountObjectId','body.properties.InitiatingProcessAccountObjectId') == "null", null(), isnotnull(coalesce('properties.InitiatingProcessAccountObjectId','body.properties.InitiatingProcessAccountObjectId')), "{" . upper(coalesce('properties.InitiatingProcessAccountObjectId','body.properties.InitiatingProcessAccountObjectId')) . "}")
# I am making a lot of assumptions here
EVAL-process = case(coalesce(category,'body.category') IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), if(coalesce('properties.FileName','body.properties.FileName') != "null", coalesce('properties.FileName','body.properties.FileName'),null()), 1==1, coalesce(process_path_no_filename, "") . if(isnotnull(process_path_no_filename), "\\", "") . coalesce(trim(process_name_extracted, "\""), if(coalesce('properties.FileName','body.properties.FileName') != "null", coalesce('properties.FileName','body.properties.FileName'),null()), "") . case(coalesce('properties.FileName','body.properties.FileName') == trim(process_args2, "\""), "", isnotnull(process_args2) AND process_args2 != "null", " " . process_args2, isnotnull(process_args), " " . process_args, 1==1, ""))

EVAL-parent_process = case(coalesce(category,'body.category') IN ("AdvancedHunting-DeviceAlertEvents", "AdvancedHunting-AlertInfo", "AdvancedHunting-AlertEvidence"), if(coalesce('properties.InitiatingProcessFileName','body.properties.InitiatingProcessFileName') != "null", coalesce('properties.InitiatingProcessFileName','body.properties.InitiatingProcessFileName'),null()), 1==1, coalesce(parent_process_path_no_filename, "") . if(isnotnull(parent_process_path_no_filename), "\\", "") . coalesce(trim(parent_process_name_extracted, "\""), if(coalesce('properties.InitiatingProcessFileName','body.properties.InitiatingProcessFileName') != "null", coalesce('properties.InitiatingProcessFileName','body.properties.InitiatingProcessFileName'),null()), "") . case(coalesce('properties.InitiatingProcessFileName','body.properties.InitiatingProcessFileName') == trim(parent_process_args2, "\""), "", isnotnull(parent_process_args2) AND parent_process_args2 != "null", " " . parent_process_args2, isnotnull(parent_process_args), " " . parent_process_args, 1==1, ""))

EVAL-parent_process_exec = replace(coalesce('properties.InitiatingProcessFolderPath','body.properties.InitiatingProcessFolderPath'),"(.*\\\)(?=.*(\.\w*)$|(\w+)$)","")
EVAL-process_exec = replace(coalesce('properties.FolderPath','body.properties.FolderPath'),"(.*\\\)(?=.*(\.\w*)$|(\w+)$)","")

EVAL-original_file_name = case(coalesce('properties.InitiatingProcessVersionInfoOriginalFileName','body.properties.InitiatingProcessVersionInfoOriginalFileName') != "null", coalesce('properties.InitiatingProcessVersionInfoOriginalFileName','body.properties.InitiatingProcessVersionInfoOriginalFileName'), 1=1, null())
EVAL-loaded_file = case(category=="AdvancedHunting-DeviceImageLoadEvents", coalesce('properties.FileName','body.properties.FileName'), 1=1, null())

# Inventory node
EVAL-serial = case(category=="AdvancedHunting-DeviceInfo" OR category=="AdvancedHunting-DeviceNetworkInfo", 'properties.DeviceId', 1==1, null())
EVAL-version = case('properties.OSVersionInfo' != "", 'properties.OSVersionInfo', 1=1, null())
EVAL-os = case('properties.OSPlatform' != "null", 'properties.OSPlatform', 1=1, null())
# IP is (currently) not a multivalue field, so if there are multiple IPs, we can only add one here. Need to understand these logs in more detail first.
# mac is also not a multivalue field... devices will mostly have more than one MAC.. could append them with a pipe maybe?

# Web node
EVAL-url = coalesce('properties.Url','body.properties.Url')
EVAL-url_length = len(coalesce('properties.Url','body.properties.Url'))
REPORT-0defender-web_url_parsing = defender-web_url_parsing, defender-web_url_parsing-body

# For our saved search populating the Malware DM
[defender:advancedhunting:malware]
DATETIME_CONFIG =
KV_MODE = JSON
LINE_BREAKER = ([\r\n]+)
NO_BINARY_CHECK = true
SHOULD_LINEMERGE = false
TIME_PREFIX = "time":
TRUNCATE = 0
category = Structured
description = Defender Advanced Hunting Malware Summary
disabled = false
pulldown_type = true

# For our saved search populating the Email DM
[defender:advancedhunting:email]
DATETIME_CONFIG =
KV_MODE = JSON
LINE_BREAKER = ([\r\n]+)
NO_BINARY_CHECK = true
SHOULD_LINEMERGE = false
TIME_PREFIX = "time":
TRUNCATE = 0
category = Structured
description = Defender Advanced Hunting Email Summary
disabled = false
pulldown_type = true
EVAL-recipient = spath(_raw,"recipient{}")
EVAL-recipient_domain = spath(_raw,"recipient_domain{}")
EVAL-file_hash = spath(_raw,"file_hash{}")
EVAL-file_name = spath(_raw,"file_name{}")
EVAL-file_size = spath(_raw,"file_size{}")
EVAL-url = spath(_raw,"url{}")
